README:Updated Architecture
